-- --------------------------------------------------------
-- Хост:                         127.0.0.1
-- Версия сервера:               10.3.16-MariaDB - mariadb.org binary distribution
-- Операционная система:         Win64
-- HeidiSQL Версия:              10.2.0.5599
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- Дамп структуры базы данных devhub
CREATE DATABASE IF NOT EXISTS `devhub` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `devhub`;

-- Дамп структуры для таблица devhub.author
CREATE TABLE IF NOT EXISTS `author` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `author_id` int(11) DEFAULT NULL,
  `post_id` int(11) DEFAULT NULL,
  `body` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Дамп данных таблицы devhub.author: ~0 rows (приблизительно)
/*!40000 ALTER TABLE `author` DISABLE KEYS */;
/*!40000 ALTER TABLE `author` ENABLE KEYS */;

-- Дамп структуры для таблица devhub.comments
CREATE TABLE IF NOT EXISTS `comments` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `body` text DEFAULT NULL,
  `post_id` int(11) DEFAULT NULL,
  `author_id` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

-- Дамп данных таблицы devhub.comments: ~2 rows (приблизительно)
/*!40000 ALTER TABLE `comments` DISABLE KEYS */;
INSERT INTO `comments` (`id`, `body`, `post_id`, `author_id`, `created_at`, `updated_at`) VALUES
	(1, 'asd', 1, 2, '2019-07-22 13:39:19', '2019-07-22 13:39:19'),
	(2, 'фывфыв', 4, 2, '2019-07-22 16:02:10', '2019-07-22 16:02:10'),
	(3, 'test', 308, 2, '2019-07-25 00:22:13', '2019-07-25 00:22:13');
/*!40000 ALTER TABLE `comments` ENABLE KEYS */;

-- Дамп структуры для таблица devhub.followers
CREATE TABLE IF NOT EXISTS `followers` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `follower_id` int(11) DEFAULT NULL,
  `leader_id` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=9 DEFAULT CHARSET=utf8;

-- Дамп данных таблицы devhub.followers: ~2 rows (приблизительно)
/*!40000 ALTER TABLE `followers` DISABLE KEYS */;
INSERT INTO `followers` (`id`, `follower_id`, `leader_id`, `created_at`, `updated_at`) VALUES
	(6, 2, 2, '2019-07-25 23:48:08', '2019-07-25 23:48:08');
/*!40000 ALTER TABLE `followers` ENABLE KEYS */;

-- Дамп структуры для таблица devhub.hubs
CREATE TABLE IF NOT EXISTS `hubs` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `logo` tinytext DEFAULT NULL,
  `name` char(50) DEFAULT NULL,
  `description` tinytext DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=415 DEFAULT CHARSET=utf8;

-- Дамп данных таблицы devhub.hubs: ~414 rows (приблизительно)
/*!40000 ALTER TABLE `hubs` DISABLE KEYS */;
INSERT INTO `hubs` (`id`, `logo`, `name`, `description`, `created_at`, `updated_at`) VALUES
	(1, 'images/hubs/php.svg', 'PHP', ' dinamik veb səhifələr yaratmaq üçün nəzərdə tutulmuş bir skriptləşdirmə dilidir', '2019-07-24 00:26:19', '2019-07-24 00:36:39'),
	(2, NULL, 'Тематические', NULL, '2019-07-25 21:02:26', '2019-07-25 21:02:26'),
	(3, NULL, 'nix', NULL, '2019-07-25 21:02:26', '2019-07-25 21:02:26'),
	(4, NULL, '.NET', NULL, '2019-07-25 21:02:26', '2019-07-25 21:02:26'),
	(5, NULL, '1С-Битрикс', NULL, '2019-07-25 21:02:27', '2019-07-25 21:02:27'),
	(6, NULL, '3D-принтеры', NULL, '2019-07-25 21:02:27', '2019-07-25 21:02:27'),
	(7, NULL, 'API', NULL, '2019-07-25 21:02:27', '2019-07-25 21:02:27'),
	(8, NULL, 'AR и VR', NULL, '2019-07-25 21:02:27', '2019-07-25 21:02:27'),
	(9, NULL, 'ASP', NULL, '2019-07-25 21:02:27', '2019-07-25 21:02:27'),
	(10, NULL, 'Accessibility', NULL, '2019-07-25 21:02:27', '2019-07-25 21:02:27'),
	(11, NULL, 'Action Script', NULL, '2019-07-25 21:02:27', '2019-07-25 21:02:27'),
	(12, NULL, 'Adobe Flash', NULL, '2019-07-25 21:02:27', '2019-07-25 21:02:27'),
	(13, NULL, 'Agile', NULL, '2019-07-25 21:02:27', '2019-07-25 21:02:27'),
	(14, NULL, 'Ajax', NULL, '2019-07-25 21:02:27', '2019-07-25 21:02:27'),
	(15, NULL, 'Amazon Web Services', NULL, '2019-07-25 21:02:27', '2019-07-25 21:02:27'),
	(16, NULL, 'Angular', NULL, '2019-07-25 21:02:27', '2019-07-25 21:02:27'),
	(17, NULL, 'Apache', NULL, '2019-07-25 21:02:27', '2019-07-25 21:02:27'),
	(18, NULL, 'Apache Flex', NULL, '2019-07-25 21:02:27', '2019-07-25 21:02:27'),
	(19, NULL, 'Assembler', NULL, '2019-07-25 21:02:27', '2019-07-25 21:02:27'),
	(20, NULL, 'Asterisk', NULL, '2019-07-25 21:02:28', '2019-07-25 21:02:28'),
	(21, NULL, 'Atlassian', NULL, '2019-07-25 21:02:28', '2019-07-25 21:02:28'),
	(22, NULL, 'Big Data', NULL, '2019-07-25 21:02:28', '2019-07-25 21:02:28'),
	(23, NULL, 'Brainfuck', NULL, '2019-07-25 21:02:28', '2019-07-25 21:02:28'),
	(24, NULL, 'C', NULL, '2019-07-25 21:02:28', '2019-07-25 21:02:28'),
	(25, NULL, 'C#', NULL, '2019-07-25 21:02:28', '2019-07-25 21:02:28'),
	(26, NULL, 'C++', NULL, '2019-07-25 21:02:28', '2019-07-25 21:02:28'),
	(27, NULL, 'CAD/CAM', NULL, '2019-07-25 21:02:28', '2019-07-25 21:02:28'),
	(28, NULL, 'CGI (графика)', NULL, '2019-07-25 21:02:28', '2019-07-25 21:02:28'),
	(29, NULL, 'CMS', NULL, '2019-07-25 21:02:28', '2019-07-25 21:02:28'),
	(30, NULL, 'CRM-системы', NULL, '2019-07-25 21:02:28', '2019-07-25 21:02:28'),
	(31, NULL, 'CSS', NULL, '2019-07-25 21:02:28', '2019-07-25 21:02:28'),
	(32, NULL, 'CTF', NULL, '2019-07-25 21:02:29', '2019-07-25 21:02:29'),
	(33, NULL, 'CakePHP', NULL, '2019-07-25 21:02:29', '2019-07-25 21:02:29'),
	(34, NULL, 'Canvas', NULL, '2019-07-25 21:02:29', '2019-07-25 21:02:29'),
	(35, NULL, 'Cisco', NULL, '2019-07-25 21:02:29', '2019-07-25 21:02:29'),
	(36, NULL, 'Clojure', NULL, '2019-07-25 21:02:29', '2019-07-25 21:02:29'),
	(37, NULL, 'Cobol', NULL, '2019-07-25 21:02:29', '2019-07-25 21:02:29'),
	(38, NULL, 'Cocoa', NULL, '2019-07-25 21:02:29', '2019-07-25 21:02:29'),
	(39, NULL, 'CodeIgniter', NULL, '2019-07-25 21:02:29', '2019-07-25 21:02:29'),
	(40, NULL, 'CoffeeScript', NULL, '2019-07-25 21:02:29', '2019-07-25 21:02:29'),
	(41, NULL, 'Creative Commons', NULL, '2019-07-25 21:02:29', '2019-07-25 21:02:29'),
	(42, NULL, 'Cubrid', NULL, '2019-07-25 21:02:29', '2019-07-25 21:02:29'),
	(43, NULL, 'D', NULL, '2019-07-25 21:02:29', '2019-07-25 21:02:29'),
	(44, NULL, 'DIY или Сделай сам', NULL, '2019-07-25 21:02:29', '2019-07-25 21:02:29'),
	(45, NULL, 'DNS', NULL, '2019-07-25 21:02:29', '2019-07-25 21:02:29'),
	(46, NULL, 'Dart', NULL, '2019-07-25 21:02:30', '2019-07-25 21:02:30'),
	(47, NULL, 'Data Mining', NULL, '2019-07-25 21:02:30', '2019-07-25 21:02:30'),
	(48, NULL, 'Delphi', NULL, '2019-07-25 21:02:30', '2019-07-25 21:02:30'),
	(49, NULL, 'Derby.js', NULL, '2019-07-25 21:02:30', '2019-07-25 21:02:30'),
	(50, NULL, 'DevOps', NULL, '2019-07-25 21:02:30', '2019-07-25 21:02:30'),
	(51, NULL, 'Django', NULL, '2019-07-25 21:02:30', '2019-07-25 21:02:30'),
	(52, NULL, 'Doctrine ORM', NULL, '2019-07-25 21:02:30', '2019-07-25 21:02:30'),
	(53, NULL, 'Drupal', NULL, '2019-07-25 21:02:30', '2019-07-25 21:02:30'),
	(54, NULL, 'ECM/СЭД', NULL, '2019-07-25 21:02:30', '2019-07-25 21:02:30'),
	(55, NULL, 'ERP-системы', NULL, '2019-07-25 21:02:30', '2019-07-25 21:02:30'),
	(56, NULL, 'Eclipse', NULL, '2019-07-25 21:02:30', '2019-07-25 21:02:30'),
	(57, NULL, 'Elixir/Phoenix', NULL, '2019-07-25 21:02:30', '2019-07-25 21:02:30'),
	(58, NULL, 'Elm', NULL, '2019-07-25 21:02:30', '2019-07-25 21:02:30'),
	(59, NULL, 'Emacs', NULL, '2019-07-25 21:02:30', '2019-07-25 21:02:30'),
	(60, NULL, 'Email-маркетинг', NULL, '2019-07-25 21:02:31', '2019-07-25 21:02:31'),
	(61, NULL, 'Erlang/OTP', NULL, '2019-07-25 21:02:31', '2019-07-25 21:02:31'),
	(62, NULL, 'F#', NULL, '2019-07-25 21:02:31', '2019-07-25 21:02:31'),
	(63, NULL, 'FPGA', NULL, '2019-07-25 21:02:31', '2019-07-25 21:02:31'),
	(64, NULL, 'Facebook API', NULL, '2019-07-25 21:02:31', '2019-07-25 21:02:31'),
	(65, NULL, 'Fidonet', NULL, '2019-07-25 21:02:31', '2019-07-25 21:02:31'),
	(66, NULL, 'Firebird/Interbase', NULL, '2019-07-25 21:02:31', '2019-07-25 21:02:31'),
	(67, NULL, 'Firefox', NULL, '2019-07-25 21:02:31', '2019-07-25 21:02:31'),
	(68, NULL, 'Flask', NULL, '2019-07-25 21:02:31', '2019-07-25 21:02:31'),
	(69, NULL, 'Flutter', NULL, '2019-07-25 21:02:31', '2019-07-25 21:02:31'),
	(70, NULL, 'Forth', NULL, '2019-07-25 21:02:31', '2019-07-25 21:02:31'),
	(71, NULL, 'Fortran', NULL, '2019-07-25 21:02:31', '2019-07-25 21:02:31'),
	(72, NULL, 'GPGPU', NULL, '2019-07-25 21:02:31', '2019-07-25 21:02:31'),
	(73, NULL, 'GTD', NULL, '2019-07-25 21:02:31', '2019-07-25 21:02:31'),
	(74, NULL, 'GTK+', NULL, '2019-07-25 21:02:31', '2019-07-25 21:02:31'),
	(75, NULL, 'Git', NULL, '2019-07-25 21:02:32', '2019-07-25 21:02:32'),
	(76, NULL, 'GitHub', NULL, '2019-07-25 21:02:32', '2019-07-25 21:02:32'),
	(77, NULL, 'Go', NULL, '2019-07-25 21:02:32', '2019-07-25 21:02:32'),
	(78, NULL, 'Google API', NULL, '2019-07-25 21:02:32', '2019-07-25 21:02:32'),
	(79, NULL, 'Google App Engine', NULL, '2019-07-25 21:02:32', '2019-07-25 21:02:32'),
	(80, NULL, 'Google Chrome', NULL, '2019-07-25 21:02:32', '2019-07-25 21:02:32'),
	(81, NULL, 'Google Cloud Platform', NULL, '2019-07-25 21:02:32', '2019-07-25 21:02:32'),
	(82, NULL, 'Google Cloud Vision API', NULL, '2019-07-25 21:02:32', '2019-07-25 21:02:32'),
	(83, NULL, 'Google Web Toolkit', NULL, '2019-07-25 21:02:32', '2019-07-25 21:02:32'),
	(84, NULL, 'Gradle', NULL, '2019-07-25 21:02:32', '2019-07-25 21:02:32'),
	(85, NULL, 'GreaseMonkey', NULL, '2019-07-25 21:02:32', '2019-07-25 21:02:32'),
	(86, NULL, 'Groovy & Grails', NULL, '2019-07-25 21:02:32', '2019-07-25 21:02:32'),
	(87, NULL, 'Growth Hacking', NULL, '2019-07-25 21:02:32', '2019-07-25 21:02:32'),
	(88, NULL, 'HTML', NULL, '2019-07-25 21:02:32', '2019-07-25 21:02:32'),
	(89, NULL, 'Habr', NULL, '2019-07-25 21:02:33', '2019-07-25 21:02:33'),
	(90, NULL, 'Habr API', NULL, '2019-07-25 21:02:33', '2019-07-25 21:02:33'),
	(91, NULL, 'Hadoop', NULL, '2019-07-25 21:02:33', '2019-07-25 21:02:33'),
	(92, NULL, 'Haskell', NULL, '2019-07-25 21:02:33', '2019-07-25 21:02:33'),
	(93, NULL, 'Haxe', NULL, '2019-07-25 21:02:33', '2019-07-25 21:02:33'),
	(94, NULL, 'Help Desk Software', NULL, '2019-07-25 21:02:33', '2019-07-25 21:02:33'),
	(95, NULL, 'I2P', NULL, '2019-07-25 21:02:33', '2019-07-25 21:02:33'),
	(96, NULL, 'IIS', NULL, '2019-07-25 21:02:33', '2019-07-25 21:02:33'),
	(97, NULL, 'INFOLUST', NULL, '2019-07-25 21:02:33', '2019-07-25 21:02:33'),
	(98, NULL, 'IPFS', NULL, '2019-07-25 21:02:33', '2019-07-25 21:02:33'),
	(99, NULL, 'IPTV', NULL, '2019-07-25 21:02:33', '2019-07-25 21:02:33'),
	(100, NULL, 'IPv6', NULL, '2019-07-25 21:02:33', '2019-07-25 21:02:33'),
	(101, NULL, 'IT-инфраструктура', NULL, '2019-07-25 21:02:33', '2019-07-25 21:02:33'),
	(102, NULL, 'IT-компании', NULL, '2019-07-25 21:02:33', '2019-07-25 21:02:33'),
	(103, NULL, 'IT-стандарты', NULL, '2019-07-25 21:02:34', '2019-07-25 21:02:34'),
	(104, NULL, 'IT-эмиграция', NULL, '2019-07-25 21:02:34', '2019-07-25 21:02:34'),
	(105, NULL, 'Internet Explorer', NULL, '2019-07-25 21:02:34', '2019-07-25 21:02:34'),
	(106, NULL, 'Java', NULL, '2019-07-25 21:02:34', '2019-07-25 21:02:34'),
	(107, NULL, 'JavaScript', NULL, '2019-07-25 21:02:34', '2019-07-25 21:02:34'),
	(108, NULL, 'Joomla', NULL, '2019-07-25 21:02:34', '2019-07-25 21:02:34'),
	(109, NULL, 'Julia', NULL, '2019-07-25 21:02:34', '2019-07-25 21:02:34'),
	(110, NULL, 'Kohana', NULL, '2019-07-25 21:02:34', '2019-07-25 21:02:34'),
	(111, NULL, 'Kotlin', NULL, '2019-07-25 21:02:34', '2019-07-25 21:02:34'),
	(112, NULL, 'Kubernetes', NULL, '2019-07-25 21:02:34', '2019-07-25 21:02:34'),
	(113, NULL, 'LaTeX', NULL, '2019-07-25 21:02:34', '2019-07-25 21:02:34'),
	(114, NULL, 'LabVIEW', NULL, '2019-07-25 21:02:34', '2019-07-25 21:02:34'),
	(115, NULL, 'Laravel', NULL, '2019-07-25 21:02:34', '2019-07-25 21:02:34'),
	(116, NULL, 'Lisp', NULL, '2019-07-25 21:02:34', '2019-07-25 21:02:34'),
	(117, NULL, 'LiveStreet', NULL, '2019-07-25 21:02:34', '2019-07-25 21:02:34'),
	(118, NULL, 'Lua', NULL, '2019-07-25 21:02:35', '2019-07-25 21:02:35'),
	(119, NULL, 'MODX', NULL, '2019-07-25 21:02:35', '2019-07-25 21:02:35'),
	(120, NULL, 'Magento', NULL, '2019-07-25 21:02:35', '2019-07-25 21:02:35'),
	(121, NULL, 'Maps API', NULL, '2019-07-25 21:02:35', '2019-07-25 21:02:35'),
	(122, NULL, 'Matlab', NULL, '2019-07-25 21:02:35', '2019-07-25 21:02:35'),
	(123, NULL, 'Mercurial', NULL, '2019-07-25 21:02:35', '2019-07-25 21:02:35'),
	(124, NULL, 'Mesh-сети', NULL, '2019-07-25 21:02:35', '2019-07-25 21:02:35'),
	(125, NULL, 'Meteor.JS', NULL, '2019-07-25 21:02:35', '2019-07-25 21:02:35'),
	(126, NULL, 'Microsoft Access', NULL, '2019-07-25 21:02:35', '2019-07-25 21:02:35'),
	(127, NULL, 'Microsoft Azure', NULL, '2019-07-25 21:02:35', '2019-07-25 21:02:35'),
	(128, NULL, 'Microsoft Edge', NULL, '2019-07-25 21:02:35', '2019-07-25 21:02:35'),
	(129, NULL, 'Microsoft SQL Server', NULL, '2019-07-25 21:02:35', '2019-07-25 21:02:35'),
	(130, NULL, 'MongoDB', NULL, '2019-07-25 21:02:35', '2019-07-25 21:02:35'),
	(131, NULL, 'Mono и Moonlight', NULL, '2019-07-25 21:02:36', '2019-07-25 21:02:36'),
	(132, NULL, 'MooTools', NULL, '2019-07-25 21:02:36', '2019-07-25 21:02:36'),
	(133, NULL, 'MySQL', NULL, '2019-07-25 21:02:36', '2019-07-25 21:02:36'),
	(134, NULL, 'Natural Language Processing', NULL, '2019-07-25 21:02:36', '2019-07-25 21:02:36'),
	(135, NULL, 'Nginx', NULL, '2019-07-25 21:02:36', '2019-07-25 21:02:36'),
	(136, NULL, 'NoSQL', NULL, '2019-07-25 21:02:36', '2019-07-25 21:02:36'),
	(137, NULL, 'Node.JS', NULL, '2019-07-25 21:02:36', '2019-07-25 21:02:36'),
	(138, NULL, 'Objective C', NULL, '2019-07-25 21:02:36', '2019-07-25 21:02:36'),
	(139, NULL, 'Open source', NULL, '2019-07-25 21:02:36', '2019-07-25 21:02:36'),
	(140, NULL, 'OpenStreetMap', NULL, '2019-07-25 21:02:36', '2019-07-25 21:02:36'),
	(141, NULL, 'Openshift', NULL, '2019-07-25 21:02:36', '2019-07-25 21:02:36'),
	(142, NULL, 'Opera', NULL, '2019-07-25 21:02:36', '2019-07-25 21:02:36'),
	(143, NULL, 'Oracle', NULL, '2019-07-25 21:02:36', '2019-07-25 21:02:36'),
	(144, NULL, 'PDF', NULL, '2019-07-25 21:02:36', '2019-07-25 21:02:36'),
	(145, NULL, 'PHP', NULL, '2019-07-25 21:02:37', '2019-07-25 21:02:37'),
	(146, NULL, 'Perl', NULL, '2019-07-25 21:02:37', '2019-07-25 21:02:37'),
	(147, NULL, 'Phalcon', NULL, '2019-07-25 21:02:37', '2019-07-25 21:02:37'),
	(148, NULL, 'PostgreSQL', NULL, '2019-07-25 21:02:37', '2019-07-25 21:02:37'),
	(149, NULL, 'PowerShell', NULL, '2019-07-25 21:02:37', '2019-07-25 21:02:37'),
	(150, NULL, 'Processing', NULL, '2019-07-25 21:02:37', '2019-07-25 21:02:37'),
	(151, NULL, 'Prolog', NULL, '2019-07-25 21:02:37', '2019-07-25 21:02:37'),
	(152, NULL, 'Puppet', NULL, '2019-07-25 21:02:37', '2019-07-25 21:02:37'),
	(153, NULL, 'Python', NULL, '2019-07-25 21:02:37', '2019-07-25 21:02:37'),
	(154, NULL, 'Qt', NULL, '2019-07-25 21:02:37', '2019-07-25 21:02:37'),
	(155, NULL, 'R', NULL, '2019-07-25 21:02:37', '2019-07-25 21:02:37'),
	(156, NULL, 'ReactJS', NULL, '2019-07-25 21:02:37', '2019-07-25 21:02:37'),
	(157, NULL, 'Ruby', NULL, '2019-07-25 21:02:37', '2019-07-25 21:02:37'),
	(158, NULL, 'Ruby on Rails', NULL, '2019-07-25 21:02:38', '2019-07-25 21:02:38'),
	(159, NULL, 'Rust', NULL, '2019-07-25 21:02:38', '2019-07-25 21:02:38'),
	(160, NULL, 'SAN', NULL, '2019-07-25 21:02:38', '2019-07-25 21:02:38'),
	(161, NULL, 'SCADA', NULL, '2019-07-25 21:02:38', '2019-07-25 21:02:38'),
	(162, NULL, 'SQL', NULL, '2019-07-25 21:02:38', '2019-07-25 21:02:38'),
	(163, NULL, 'SQLite', NULL, '2019-07-25 21:02:38', '2019-07-25 21:02:38'),
	(164, NULL, 'SaaS / S+S', NULL, '2019-07-25 21:02:38', '2019-07-25 21:02:38'),
	(165, NULL, 'Safari', NULL, '2019-07-25 21:02:38', '2019-07-25 21:02:38'),
	(166, NULL, 'Scala', NULL, '2019-07-25 21:02:38', '2019-07-25 21:02:38'),
	(167, NULL, 'Service Desk', NULL, '2019-07-25 21:02:38', '2019-07-25 21:02:38'),
	(168, NULL, 'SharePoint', NULL, '2019-07-25 21:02:38', '2019-07-25 21:02:38'),
	(169, NULL, 'Silverlight', NULL, '2019-07-25 21:02:38', '2019-07-25 21:02:38'),
	(170, NULL, 'Small Basic', NULL, '2019-07-25 21:02:38', '2019-07-25 21:02:38'),
	(171, NULL, 'Smalltalk', NULL, '2019-07-25 21:02:39', '2019-07-25 21:02:39'),
	(172, NULL, 'Solidity', NULL, '2019-07-25 21:02:39', '2019-07-25 21:02:39'),
	(173, NULL, 'Sphinx', NULL, '2019-07-25 21:02:39', '2019-07-25 21:02:39'),
	(174, NULL, 'SvelteJS', NULL, '2019-07-25 21:02:39', '2019-07-25 21:02:39'),
	(175, NULL, 'Swift', NULL, '2019-07-25 21:02:39', '2019-07-25 21:02:39'),
	(176, NULL, 'Symfony', NULL, '2019-07-25 21:02:39', '2019-07-25 21:02:39'),
	(177, NULL, 'TDD', NULL, '2019-07-25 21:02:39', '2019-07-25 21:02:39'),
	(178, NULL, 'TYPO3', NULL, '2019-07-25 21:02:39', '2019-07-25 21:02:39'),
	(179, NULL, 'Twisted', NULL, '2019-07-25 21:02:39', '2019-07-25 21:02:39'),
	(180, NULL, 'Twitter API', NULL, '2019-07-25 21:02:39', '2019-07-25 21:02:39'),
	(181, NULL, 'TypeScript', NULL, '2019-07-25 21:02:39', '2019-07-25 21:02:39'),
	(182, NULL, 'UEFI', NULL, '2019-07-25 21:02:39', '2019-07-25 21:02:39'),
	(183, NULL, 'UML Design', NULL, '2019-07-25 21:02:39', '2019-07-25 21:02:39'),
	(184, NULL, 'Unity', NULL, '2019-07-25 21:02:39', '2019-07-25 21:02:39'),
	(185, NULL, 'Unreal Engine', NULL, '2019-07-25 21:02:40', '2019-07-25 21:02:40'),
	(186, NULL, 'Usability', NULL, '2019-07-25 21:02:40', '2019-07-25 21:02:40'),
	(187, NULL, 'VIM', NULL, '2019-07-25 21:02:40', '2019-07-25 21:02:40'),
	(188, NULL, 'Visual Basic for Applications', NULL, '2019-07-25 21:02:40', '2019-07-25 21:02:40'),
	(189, NULL, 'Visual Studio', NULL, '2019-07-25 21:02:40', '2019-07-25 21:02:40'),
	(190, NULL, 'VueJS', NULL, '2019-07-25 21:02:40', '2019-07-25 21:02:40'),
	(191, NULL, 'WebAssembly', NULL, '2019-07-25 21:02:40', '2019-07-25 21:02:40'),
	(192, NULL, 'WebGL', NULL, '2019-07-25 21:02:40', '2019-07-25 21:02:40'),
	(193, NULL, 'WordPress', NULL, '2019-07-25 21:02:40', '2019-07-25 21:02:40'),
	(194, NULL, 'XML', NULL, '2019-07-25 21:02:40', '2019-07-25 21:02:40'),
	(195, NULL, 'XSLT', NULL, '2019-07-25 21:02:40', '2019-07-25 21:02:40'),
	(196, NULL, 'Xamarin', NULL, '2019-07-25 21:02:40', '2019-07-25 21:02:40'),
	(197, NULL, 'Xcode', NULL, '2019-07-25 21:02:40', '2019-07-25 21:02:40'),
	(198, NULL, 'Yii', NULL, '2019-07-25 21:02:40', '2019-07-25 21:02:40'),
	(199, NULL, 'Zend Framework', NULL, '2019-07-25 21:02:41', '2019-07-25 21:02:41'),
	(200, NULL, 'jQuery', NULL, '2019-07-25 21:02:41', '2019-07-25 21:02:41'),
	(201, NULL, 'Автомобильные гаджеты', NULL, '2019-07-25 21:02:41', '2019-07-25 21:02:41'),
	(202, NULL, 'Администрирование баз данных', NULL, '2019-07-25 21:02:41', '2019-07-25 21:02:41'),
	(203, NULL, 'Администрирование доменных имен', NULL, '2019-07-25 21:02:41', '2019-07-25 21:02:41'),
	(204, NULL, 'Алгоритмы', NULL, '2019-07-25 21:02:41', '2019-07-25 21:02:41'),
	(205, NULL, 'Анализ и проектирование систем', NULL, '2019-07-25 21:02:41', '2019-07-25 21:02:41'),
	(206, NULL, 'Аналитика мобильных приложений', NULL, '2019-07-25 21:02:41', '2019-07-25 21:02:41'),
	(207, NULL, 'Антивирусная защита', NULL, '2019-07-25 21:02:41', '2019-07-25 21:02:41'),
	(208, NULL, 'Астрономия', NULL, '2019-07-25 21:02:41', '2019-07-25 21:02:41'),
	(209, NULL, 'Беспроводные технологии', NULL, '2019-07-25 21:02:41', '2019-07-25 21:02:41'),
	(210, NULL, 'Библиотека ExtJS/Sencha', NULL, '2019-07-25 21:02:41', '2019-07-25 21:02:41'),
	(211, NULL, 'Бизнес-модели', NULL, '2019-07-25 21:02:41', '2019-07-25 21:02:41'),
	(212, NULL, 'Биллинговые системы', NULL, '2019-07-25 21:02:42', '2019-07-25 21:02:42'),
	(213, NULL, 'Биографии гиков', NULL, '2019-07-25 21:02:42', '2019-07-25 21:02:42'),
	(214, NULL, 'Биотехнологии', NULL, '2019-07-25 21:02:42', '2019-07-25 21:02:42'),
	(215, NULL, 'Браузеры', NULL, '2019-07-25 21:02:42', '2019-07-25 21:02:42'),
	(216, NULL, 'Брендинг', NULL, '2019-07-25 21:02:42', '2019-07-25 21:02:42'),
	(217, NULL, 'Будущее здесь', NULL, '2019-07-25 21:02:42', '2019-07-25 21:02:42'),
	(218, NULL, 'Веб-аналитика', NULL, '2019-07-25 21:02:42', '2019-07-25 21:02:42'),
	(219, NULL, 'Веб-дизайн', NULL, '2019-07-25 21:02:42', '2019-07-25 21:02:42'),
	(220, NULL, 'Венчурные инвестиции', NULL, '2019-07-25 21:02:42', '2019-07-25 21:02:42'),
	(221, NULL, 'Верстка писем', NULL, '2019-07-25 21:02:42', '2019-07-25 21:02:42'),
	(222, NULL, 'Видеокарты', NULL, '2019-07-25 21:02:42', '2019-07-25 21:02:42'),
	(223, NULL, 'Видеоконференцсвязь', NULL, '2019-07-25 21:02:42', '2019-07-25 21:02:42'),
	(224, NULL, 'Видеотехника', NULL, '2019-07-25 21:02:42', '2019-07-25 21:02:42'),
	(225, NULL, 'Визуализация данных', NULL, '2019-07-25 21:02:43', '2019-07-25 21:02:43'),
	(226, NULL, 'Виртуализация', NULL, '2019-07-25 21:02:43', '2019-07-25 21:02:43'),
	(227, NULL, 'Вконтакте API', NULL, '2019-07-25 21:02:43', '2019-07-25 21:02:43'),
	(228, NULL, 'Восстановление данных', NULL, '2019-07-25 21:02:43', '2019-07-25 21:02:43'),
	(229, NULL, 'Высокая производительность', NULL, '2019-07-25 21:02:43', '2019-07-25 21:02:43'),
	(230, NULL, 'Гаджеты', NULL, '2019-07-25 21:02:43', '2019-07-25 21:02:43'),
	(231, NULL, 'Геоинформационные сервисы', NULL, '2019-07-25 21:02:43', '2019-07-25 21:02:43'),
	(232, NULL, 'Глобальные системы позиционирования', NULL, '2019-07-25 21:02:44', '2019-07-25 21:02:44'),
	(233, NULL, 'Графические оболочки', NULL, '2019-07-25 21:02:44', '2019-07-25 21:02:44'),
	(234, NULL, 'Графический дизайн', NULL, '2019-07-25 21:02:44', '2019-07-25 21:02:44'),
	(235, NULL, 'Демосцена', NULL, '2019-07-25 21:02:44', '2019-07-25 21:02:44'),
	(236, NULL, 'Децентрализованные сети', NULL, '2019-07-25 21:02:44', '2019-07-25 21:02:44'),
	(237, NULL, 'Дизайн', NULL, '2019-07-25 21:02:44', '2019-07-25 21:02:44'),
	(238, NULL, 'Дизайн игр', NULL, '2019-07-25 21:02:44', '2019-07-25 21:02:44'),
	(239, NULL, 'Дизайн мобильных приложений', NULL, '2019-07-25 21:02:44', '2019-07-25 21:02:44'),
	(240, NULL, 'Законодательство в IT', NULL, '2019-07-25 21:02:44', '2019-07-25 21:02:44'),
	(241, NULL, 'Занимательные задачки', NULL, '2019-07-25 21:02:44', '2019-07-25 21:02:44'),
	(242, NULL, 'Звук', NULL, '2019-07-25 21:02:44', '2019-07-25 21:02:44'),
	(243, NULL, 'Здоровье гика', NULL, '2019-07-25 21:02:44', '2019-07-25 21:02:44'),
	(244, NULL, 'Игры и игровые приставки', NULL, '2019-07-25 21:02:44', '2019-07-25 21:02:44'),
	(245, NULL, 'Изучение языков', NULL, '2019-07-25 21:02:45', '2019-07-25 21:02:45'),
	(246, NULL, 'Инженерные системы', NULL, '2019-07-25 21:02:45', '2019-07-25 21:02:45'),
	(247, NULL, 'Интервью', NULL, '2019-07-25 21:02:45', '2019-07-25 21:02:45'),
	(248, NULL, 'Интернет вещей', NULL, '2019-07-25 21:02:45', '2019-07-25 21:02:45'),
	(249, NULL, 'Интернет-маркетинг', NULL, '2019-07-25 21:02:45', '2019-07-25 21:02:45'),
	(250, NULL, 'Интерфейсы', NULL, '2019-07-25 21:02:45', '2019-07-25 21:02:45'),
	(251, NULL, 'Инфографика', NULL, '2019-07-25 21:02:45', '2019-07-25 21:02:45'),
	(252, NULL, 'Информационная безопасность', NULL, '2019-07-25 21:02:45', '2019-07-25 21:02:45'),
	(253, NULL, 'Искусственный интеллект', NULL, '2019-07-25 21:02:45', '2019-07-25 21:02:45'),
	(254, NULL, 'Исследования и прогнозы в IT', NULL, '2019-07-25 21:02:46', '2019-07-25 21:02:46'),
	(255, NULL, 'История IT', NULL, '2019-07-25 21:02:46', '2019-07-25 21:02:46'),
	(256, NULL, 'Карьера в IT-индустрии', NULL, '2019-07-25 21:02:46', '2019-07-25 21:02:46'),
	(257, NULL, 'Квантовые технологии', NULL, '2019-07-25 21:02:46', '2019-07-25 21:02:46'),
	(258, NULL, 'Киберпанк', NULL, '2019-07-25 21:02:46', '2019-07-25 21:02:46'),
	(259, NULL, 'Киберспорт', NULL, '2019-07-25 21:02:46', '2019-07-25 21:02:46'),
	(260, NULL, 'Клиентская оптимизация', NULL, '2019-07-25 21:02:46', '2019-07-25 21:02:46'),
	(261, NULL, 'Кодобред', NULL, '2019-07-25 21:02:46', '2019-07-25 21:02:46'),
	(262, NULL, 'Компиляторы', NULL, '2019-07-25 21:02:46', '2019-07-25 21:02:46'),
	(263, NULL, 'Компьютерная анимация', NULL, '2019-07-25 21:02:46', '2019-07-25 21:02:46'),
	(264, NULL, 'Компьютерное железо', NULL, '2019-07-25 21:02:46', '2019-07-25 21:02:46'),
	(265, NULL, 'Контекстная реклама', NULL, '2019-07-25 21:02:46', '2019-07-25 21:02:46'),
	(266, NULL, 'Контент-маркетинг', NULL, '2019-07-25 21:02:47', '2019-07-25 21:02:47'),
	(267, NULL, 'Конференции', NULL, '2019-07-25 21:02:47', '2019-07-25 21:02:47'),
	(268, NULL, 'Копирайт', NULL, '2019-07-25 21:02:47', '2019-07-25 21:02:47'),
	(269, NULL, 'Космонавтика', NULL, '2019-07-25 21:02:47', '2019-07-25 21:02:47'),
	(270, NULL, 'Краудсорсинг', NULL, '2019-07-25 21:02:47', '2019-07-25 21:02:47'),
	(271, NULL, 'Криптовалюты', NULL, '2019-07-25 21:02:47', '2019-07-25 21:02:47'),
	(272, NULL, 'Криптография', NULL, '2019-07-25 21:02:47', '2019-07-25 21:02:47'),
	(273, NULL, 'Лазеры', NULL, '2019-07-25 21:02:47', '2019-07-25 21:02:47'),
	(274, NULL, 'Лайфхаки для гиков', NULL, '2019-07-25 21:02:47', '2019-07-25 21:02:47'),
	(275, NULL, 'Логические игры', NULL, '2019-07-25 21:02:47', '2019-07-25 21:02:47'),
	(276, NULL, 'Локализация продуктов', NULL, '2019-07-25 21:02:47', '2019-07-25 21:02:47'),
	(277, NULL, 'Математика', NULL, '2019-07-25 21:02:48', '2019-07-25 21:02:48'),
	(278, NULL, 'Машинное обучение', NULL, '2019-07-25 21:02:48', '2019-07-25 21:02:48'),
	(279, NULL, 'Медгаджеты', NULL, '2019-07-25 21:02:48', '2019-07-25 21:02:48'),
	(280, NULL, 'Медийная реклама', NULL, '2019-07-25 21:02:48', '2019-07-25 21:02:48'),
	(281, NULL, 'Микросервисы', NULL, '2019-07-25 21:02:48', '2019-07-25 21:02:48'),
	(282, NULL, 'Микроформаты', NULL, '2019-07-25 21:02:48', '2019-07-25 21:02:48'),
	(283, NULL, 'Мозг', NULL, '2019-07-25 21:02:48', '2019-07-25 21:02:48'),
	(284, NULL, 'Монетизация IT-систем', NULL, '2019-07-25 21:02:48', '2019-07-25 21:02:48'),
	(285, NULL, 'Монетизация веб-сервисов', NULL, '2019-07-25 21:02:49', '2019-07-25 21:02:49'),
	(286, NULL, 'Монетизация игр', NULL, '2019-07-25 21:02:49', '2019-07-25 21:02:49'),
	(287, NULL, 'Монетизация мобильных приложений', NULL, '2019-07-25 21:02:49', '2019-07-25 21:02:49'),
	(288, NULL, 'Мониторы и ТВ', NULL, '2019-07-25 21:02:49', '2019-07-25 21:02:49'),
	(289, NULL, 'Мультикоптеры', NULL, '2019-07-25 21:02:49', '2019-07-25 21:02:49'),
	(290, NULL, 'Накопители', NULL, '2019-07-25 21:02:49', '2019-07-25 21:02:49'),
	(291, NULL, 'Нанотехнологии', NULL, '2019-07-25 21:02:49', '2019-07-25 21:02:49'),
	(292, NULL, 'Настольные компьютеры', NULL, '2019-07-25 21:02:49', '2019-07-25 21:02:49'),
	(293, NULL, 'Настройка Linux', NULL, '2019-07-25 21:02:50', '2019-07-25 21:02:50'),
	(294, NULL, 'Научная фантастика', NULL, '2019-07-25 21:02:50', '2019-07-25 21:02:50'),
	(295, NULL, 'Научно-популярное', NULL, '2019-07-25 21:02:50', '2019-07-25 21:02:50'),
	(296, NULL, 'Ненормальное программирование', NULL, '2019-07-25 21:02:50', '2019-07-25 21:02:50'),
	(297, NULL, 'Носимая электроника', NULL, '2019-07-25 21:02:50', '2019-07-25 21:02:50'),
	(298, NULL, 'Ноутбуки', NULL, '2019-07-25 21:02:50', '2019-07-25 21:02:50'),
	(299, NULL, 'ООП', NULL, '2019-07-25 21:02:50', '2019-07-25 21:02:50'),
	(300, NULL, 'Облачные вычисления', NULL, '2019-07-25 21:02:50', '2019-07-25 21:02:50'),
	(301, NULL, 'Облачные сервисы', NULL, '2019-07-25 21:02:51', '2019-07-25 21:02:51'),
	(302, NULL, 'Оболочки', NULL, '2019-07-25 21:02:51', '2019-07-25 21:02:51'),
	(303, NULL, 'Обработка изображений', NULL, '2019-07-25 21:02:51', '2019-07-25 21:02:51'),
	(304, NULL, 'Образование за рубежом', NULL, '2019-07-25 21:02:51', '2019-07-25 21:02:51'),
	(305, NULL, 'Открытые данные', NULL, '2019-07-25 21:02:51', '2019-07-25 21:02:51'),
	(306, NULL, 'Отладка', NULL, '2019-07-25 21:02:51', '2019-07-25 21:02:51'),
	(307, NULL, 'Офисы IT-компаний', NULL, '2019-07-25 21:02:51', '2019-07-25 21:02:51'),
	(308, NULL, 'Параллельное программирование', NULL, '2019-07-25 21:02:52', '2019-07-25 21:02:52'),
	(309, NULL, 'Патентование', NULL, '2019-07-25 21:02:52', '2019-07-25 21:02:52'),
	(310, NULL, 'Периферия', NULL, '2019-07-25 21:02:52', '2019-07-25 21:02:52'),
	(311, NULL, 'Планшеты', NULL, '2019-07-25 21:02:52', '2019-07-25 21:02:52'),
	(312, NULL, 'Платежные системы', NULL, '2019-07-25 21:02:52', '2019-07-25 21:02:52'),
	(313, NULL, 'Повышение конверсии', NULL, '2019-07-25 21:02:52', '2019-07-25 21:02:52'),
	(314, NULL, 'Поисковая оптимизация', NULL, '2019-07-25 21:02:52', '2019-07-25 21:02:52'),
	(315, NULL, 'Поисковые технологии', NULL, '2019-07-25 21:02:52', '2019-07-25 21:02:52'),
	(316, NULL, 'Презентации', NULL, '2019-07-25 21:02:53', '2019-07-25 21:02:53'),
	(317, NULL, 'Программирование', NULL, '2019-07-25 21:02:53', '2019-07-25 21:02:53'),
	(318, NULL, 'Программирование микроконтроллеров', NULL, '2019-07-25 21:02:53', '2019-07-25 21:02:53'),
	(319, NULL, 'Продвижение игр', NULL, '2019-07-25 21:02:53', '2019-07-25 21:02:53'),
	(320, NULL, 'Проектирование и рефакторинг', NULL, '2019-07-25 21:02:53', '2019-07-25 21:02:53'),
	(321, NULL, 'Производство и разработка электроники', NULL, '2019-07-25 21:02:53', '2019-07-25 21:02:53'),
	(322, NULL, 'Промышленное программирование', NULL, '2019-07-25 21:02:53', '2019-07-25 21:02:53'),
	(323, NULL, 'Прототипирование', NULL, '2019-07-25 21:02:53', '2019-07-25 21:02:53'),
	(324, NULL, 'Профессиональная литература', NULL, '2019-07-25 21:02:53', '2019-07-25 21:02:53'),
	(325, NULL, 'Процессоры', NULL, '2019-07-25 21:02:53', '2019-07-25 21:02:53'),
	(326, NULL, 'Работа с 3D-графикой', NULL, '2019-07-25 21:02:53', '2019-07-25 21:02:53'),
	(327, NULL, 'Работа с векторной графикой', NULL, '2019-07-25 21:02:54', '2019-07-25 21:02:54'),
	(328, NULL, 'Работа с видео', NULL, '2019-07-25 21:02:54', '2019-07-25 21:02:54'),
	(329, NULL, 'Работа с иконками', NULL, '2019-07-25 21:02:54', '2019-07-25 21:02:54'),
	(330, NULL, 'Развитие стартапа', NULL, '2019-07-25 21:02:54', '2019-07-25 21:02:54'),
	(331, NULL, 'Разработка веб-сайтов', NULL, '2019-07-25 21:02:54', '2019-07-25 21:02:54'),
	(332, NULL, 'Разработка для Office 365', NULL, '2019-07-25 21:02:54', '2019-07-25 21:02:54'),
	(333, NULL, 'Разработка для интернета вещей', NULL, '2019-07-25 21:02:54', '2019-07-25 21:02:54'),
	(334, NULL, 'Разработка игр', NULL, '2019-07-25 21:02:54', '2019-07-25 21:02:54'),
	(335, NULL, 'Разработка мобильных приложений', NULL, '2019-07-25 21:02:54', '2019-07-25 21:02:54'),
	(336, NULL, 'Разработка на Raspberry Pi', NULL, '2019-07-25 21:02:54', '2019-07-25 21:02:54'),
	(337, NULL, 'Разработка под AR и VR', NULL, '2019-07-25 21:02:55', '2019-07-25 21:02:55'),
	(338, NULL, 'Разработка под Android', NULL, '2019-07-25 21:02:55', '2019-07-25 21:02:55'),
	(339, NULL, 'Разработка под Arduino', NULL, '2019-07-25 21:02:55', '2019-07-25 21:02:55'),
	(340, NULL, 'Разработка под Bada', NULL, '2019-07-25 21:02:55', '2019-07-25 21:02:55'),
	(341, NULL, 'Разработка под Java ME', NULL, '2019-07-25 21:02:55', '2019-07-25 21:02:55'),
	(342, NULL, 'Разработка под Linux', NULL, '2019-07-25 21:02:55', '2019-07-25 21:02:55'),
	(343, NULL, 'Разработка под MacOS', NULL, '2019-07-25 21:02:55', '2019-07-25 21:02:55'),
	(344, NULL, 'Разработка под Sailfish OS', NULL, '2019-07-25 21:02:55', '2019-07-25 21:02:55'),
	(345, NULL, 'Разработка под Tizen', NULL, '2019-07-25 21:02:55', '2019-07-25 21:02:55'),
	(346, NULL, 'Разработка под Windows', NULL, '2019-07-25 21:02:56', '2019-07-25 21:02:56'),
	(347, NULL, 'Разработка под Windows Phone', NULL, '2019-07-25 21:02:56', '2019-07-25 21:02:56'),
	(348, NULL, 'Разработка под e-commerce', NULL, '2019-07-25 21:02:56', '2019-07-25 21:02:56'),
	(349, NULL, 'Разработка под iOS', NULL, '2019-07-25 21:02:56', '2019-07-25 21:02:56'),
	(350, NULL, 'Разработка робототехники', NULL, '2019-07-25 21:02:56', '2019-07-25 21:02:56'),
	(351, NULL, 'Разработка систем связи', NULL, '2019-07-25 21:02:56', '2019-07-25 21:02:56'),
	(352, NULL, 'Распределённые системы', NULL, '2019-07-25 21:02:56', '2019-07-25 21:02:56'),
	(353, NULL, 'Расширения для браузеров', NULL, '2019-07-25 21:02:56', '2019-07-25 21:02:56'),
	(354, NULL, 'Реверс-инжиниринг', NULL, '2019-07-25 21:02:56', '2019-07-25 21:02:56'),
	(355, NULL, 'Регулярные выражения', NULL, '2019-07-25 21:02:56', '2019-07-25 21:02:56'),
	(356, NULL, 'Резервное копирование', NULL, '2019-07-25 21:02:56', '2019-07-25 21:02:56'),
	(357, NULL, 'Робототехника', NULL, '2019-07-25 21:02:57', '2019-07-25 21:02:57'),
	(358, NULL, 'Семантика', NULL, '2019-07-25 21:02:57', '2019-07-25 21:02:57'),
	(359, NULL, 'Серверная оптимизация', NULL, '2019-07-25 21:02:57', '2019-07-25 21:02:57'),
	(360, NULL, 'Серверное администрирование', NULL, '2019-07-25 21:02:57', '2019-07-25 21:02:57'),
	(361, NULL, 'Сетевое оборудование', NULL, '2019-07-25 21:02:57', '2019-07-25 21:02:57'),
	(362, NULL, 'Сетевые технологии', NULL, '2019-07-25 21:02:57', '2019-07-25 21:02:57'),
	(363, NULL, 'Сжатие данных', NULL, '2019-07-25 21:02:57', '2019-07-25 21:02:57'),
	(364, NULL, 'Системное администрирование', NULL, '2019-07-25 21:02:57', '2019-07-25 21:02:57'),
	(365, NULL, 'Системное программирование', NULL, '2019-07-25 21:02:57', '2019-07-25 21:02:57'),
	(366, NULL, 'Системы обмена сообщениями', NULL, '2019-07-25 21:02:57', '2019-07-25 21:02:57'),
	(367, NULL, 'Системы сборки', NULL, '2019-07-25 21:02:57', '2019-07-25 21:02:57'),
	(368, NULL, 'Системы управления версиями', NULL, '2019-07-25 21:02:57', '2019-07-25 21:02:57'),
	(369, NULL, 'Смартфоны', NULL, '2019-07-25 21:02:57', '2019-07-25 21:02:57'),
	(370, NULL, 'Совершенный код', NULL, '2019-07-25 21:02:57', '2019-07-25 21:02:57'),
	(371, NULL, 'Сотовая связь', NULL, '2019-07-25 21:02:58', '2019-07-25 21:02:58'),
	(372, NULL, 'Софт', NULL, '2019-07-25 21:02:58', '2019-07-25 21:02:58'),
	(373, NULL, 'Социальные сети и сообщества', NULL, '2019-07-25 21:02:58', '2019-07-25 21:02:58'),
	(374, NULL, 'Спам и антиспам', NULL, '2019-07-25 21:02:58', '2019-07-25 21:02:58'),
	(375, NULL, 'Спортивное программирование', NULL, '2019-07-25 21:02:59', '2019-07-25 21:02:59'),
	(376, NULL, 'Стандарты связи', NULL, '2019-07-25 21:02:59', '2019-07-25 21:02:59'),
	(377, NULL, 'Старое железо', NULL, '2019-07-25 21:02:59', '2019-07-25 21:02:59'),
	(378, NULL, 'Статистика в IT', NULL, '2019-07-25 21:02:59', '2019-07-25 21:02:59'),
	(379, NULL, 'Суперкомпьютеры', NULL, '2019-07-25 21:02:59', '2019-07-25 21:02:59'),
	(380, NULL, 'Схемотехника', NULL, '2019-07-25 21:02:59', '2019-07-25 21:02:59'),
	(381, NULL, 'Телемедицина', NULL, '2019-07-25 21:02:59', '2019-07-25 21:02:59'),
	(382, NULL, 'Терминология IT', NULL, '2019-07-25 21:02:59', '2019-07-25 21:02:59'),
	(383, NULL, 'Тестирование IT-систем', NULL, '2019-07-25 21:02:59', '2019-07-25 21:02:59'),
	(384, NULL, 'Тестирование веб-сервисов', NULL, '2019-07-25 21:02:59', '2019-07-25 21:02:59'),
	(385, NULL, 'Тестирование игр', NULL, '2019-07-25 21:02:59', '2019-07-25 21:02:59'),
	(386, NULL, 'Тестирование мобильных приложений', NULL, '2019-07-25 21:02:59', '2019-07-25 21:02:59'),
	(387, NULL, 'Типографика', NULL, '2019-07-25 21:02:59', '2019-07-25 21:02:59'),
	(388, NULL, 'Транспорт', NULL, '2019-07-25 21:02:59', '2019-07-25 21:02:59'),
	(389, NULL, 'Умный дом', NULL, '2019-07-25 21:03:00', '2019-07-25 21:03:00'),
	(390, NULL, 'Управление e-commerce', NULL, '2019-07-25 21:03:00', '2019-07-25 21:03:00'),
	(391, NULL, 'Управление медиа', NULL, '2019-07-25 21:03:00', '2019-07-25 21:03:00'),
	(392, NULL, 'Управление персоналом', NULL, '2019-07-25 21:03:00', '2019-07-25 21:03:00'),
	(393, NULL, 'Управление продажами', NULL, '2019-07-25 21:03:00', '2019-07-25 21:03:00'),
	(394, NULL, 'Управление продуктом', NULL, '2019-07-25 21:03:00', '2019-07-25 21:03:00'),
	(395, NULL, 'Управление проектами', NULL, '2019-07-25 21:03:00', '2019-07-25 21:03:00'),
	(396, NULL, 'Управление разработкой', NULL, '2019-07-25 21:03:00', '2019-07-25 21:03:00'),
	(397, NULL, 'Управление сообществом', NULL, '2019-07-25 21:03:00', '2019-07-25 21:03:00'),
	(398, NULL, 'Урбанизм', NULL, '2019-07-25 21:03:00', '2019-07-25 21:03:00'),
	(399, NULL, 'Учебный процесс в IT', NULL, '2019-07-25 21:03:00', '2019-07-25 21:03:00'),
	(400, NULL, 'Физика', NULL, '2019-07-25 21:03:00', '2019-07-25 21:03:00'),
	(401, NULL, 'Финансы в IT', NULL, '2019-07-25 21:03:00', '2019-07-25 21:03:00'),
	(402, NULL, 'Фототехника', NULL, '2019-07-25 21:03:00', '2019-07-25 21:03:00'),
	(403, NULL, 'Фриланс', NULL, '2019-07-25 21:03:01', '2019-07-25 21:03:01'),
	(404, NULL, 'Функциональное программирование', NULL, '2019-07-25 21:03:01', '2019-07-25 21:03:01'),
	(405, NULL, 'Хакатоны', NULL, '2019-07-25 21:03:01', '2019-07-25 21:03:01'),
	(406, NULL, 'Химия', NULL, '2019-07-25 21:03:01', '2019-07-25 21:03:01'),
	(407, NULL, 'Хостинг', NULL, '2019-07-25 21:03:01', '2019-07-25 21:03:01'),
	(408, NULL, 'Хранение данных', NULL, '2019-07-25 21:03:01', '2019-07-25 21:03:01'),
	(409, NULL, 'Хранилища данных', NULL, '2019-07-25 21:03:01', '2019-07-25 21:03:01'),
	(410, NULL, 'Читальный зал', NULL, '2019-07-25 21:03:01', '2019-07-25 21:03:01'),
	(411, NULL, 'Экология', NULL, '2019-07-25 21:03:01', '2019-07-25 21:03:01'),
	(412, NULL, 'Электроника для начинающих', NULL, '2019-07-25 21:03:01', '2019-07-25 21:03:01'),
	(413, NULL, 'Энергия и элементы питания', NULL, '2019-07-25 21:03:01', '2019-07-25 21:03:01'),
	(414, NULL, 'Яндекс API', NULL, '2019-07-25 21:03:02', '2019-07-25 21:03:02');
/*!40000 ALTER TABLE `hubs` ENABLE KEYS */;

-- Дамп структуры для таблица devhub.media
CREATE TABLE IF NOT EXISTS `media` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `model_type` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `model_id` bigint(20) unsigned NOT NULL,
  `collection_name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `file_name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `mime_type` varchar(191) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `disk` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `size` int(10) unsigned NOT NULL,
  `manipulations` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL,
  `custom_properties` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL,
  `responsive_images` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin NOT NULL,
  `order_column` int(10) unsigned DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `media_model_type_model_id_index` (`model_type`,`model_id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Дамп данных таблицы devhub.media: ~1 rows (приблизительно)
/*!40000 ALTER TABLE `media` DISABLE KEYS */;
INSERT INTO `media` (`id`, `model_type`, `model_id`, `collection_name`, `name`, `file_name`, `mime_type`, `disk`, `size`, `manipulations`, `custom_properties`, `responsive_images`, `order_column`, `created_at`, `updated_at`) VALUES
	(3, 'App\\Models\\User', 2, 'avatars', 'logo1', 'logo1.png', 'image/png', 'public', 6727, '[]', '{"generated_conversions":{"small":true,"big":true,"very-big":true}}', '[]', 1, '2019-07-22 13:36:12', '2019-07-22 13:36:13');
/*!40000 ALTER TABLE `media` ENABLE KEYS */;

-- Дамп структуры для таблица devhub.migrations
CREATE TABLE IF NOT EXISTS `migrations` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `migration` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `batch` int(11) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Дамп данных таблицы devhub.migrations: ~6 rows (приблизительно)
/*!40000 ALTER TABLE `migrations` DISABLE KEYS */;
INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
	(1, '2014_10_12_000000_create_users_table', 1),
	(2, '2014_10_12_100000_create_password_resets_table', 1),
	(3, '2019_04_29_095442_create_posts_table', 1),
	(4, '2019_04_29_101357_create_author_table', 1),
	(5, '2019_07_14_131637_create_websockets_statistics_entries_table', 1),
	(6, '2019_07_20_133720_create_media_table', 1);
/*!40000 ALTER TABLE `migrations` ENABLE KEYS */;

-- Дамп структуры для таблица devhub.password_resets
CREATE TABLE IF NOT EXISTS `password_resets` (
  `email` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `token` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  KEY `password_resets_email_index` (`email`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Дамп данных таблицы devhub.password_resets: ~0 rows (приблизительно)
/*!40000 ALTER TABLE `password_resets` DISABLE KEYS */;
/*!40000 ALTER TABLE `password_resets` ENABLE KEYS */;

-- Дамп структуры для таблица devhub.posts
CREATE TABLE IF NOT EXISTS `posts` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `body` longtext COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT '0',
  `author_id` int(11) DEFAULT NULL,
  `votes` int(11) NOT NULL DEFAULT 0,
  `views` int(11) DEFAULT 0,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Дамп данных таблицы devhub.posts: ~2 rows (приблизительно)
/*!40000 ALTER TABLE `posts` DISABLE KEYS */;
INSERT INTO `posts` (`id`, `name`, `body`, `author_id`, `votes`, `views`, `created_at`, `updated_at`) VALUES
	(1, 'Let\'s play a little game with Lamoda', '<p><span style="background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);">Привет! Меня зовут Павел Савельев, я руковожу отделом автоматизации бизнес-процессов в Lamoda. Хочу пригласить вас сыграть в PHP Quest. Для участия в квесте необходимо заполнить </span><a href="https://tech.lamoda.ru/phpquest?fbclid=IwAR05tcNaXBGprD5w2i0Wdcifhq2TlM3kA0rdwLFXX9XbqE57_NzzSHpACCM" target="_blank" style="background-color: rgb(255, 255, 255); color: rgb(153, 34, 152);">анкету</a><span style="background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);">. После заполнения анкеты мы вышлем вам на почту головоломку. До 12 августа игроки присылают свои решения на quest@lamoda.ru. Спойлер: у головоломки множество решений, и мы готовы рассмотреть любое.</span></p><p><br></p><p><span style="background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);"><img src="https://habrastorage.org/webt/iv/aa/r6/ivaar6szop4s-pjboik4io6px-s.jpeg" alt="image"></span></p><p><br></p><p><span style="background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);">Всех, кто успешно справился с головоломкой, мы пригласим на финал, который состоится 16 августа в нашем офисе в Москве. Игрокам из других городов мы оплатим билеты и проживание. </span></p><p><br></p><p><span style="background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);">16 августа вас ждет финальное состязание, игры и вечеринка в лучшем офисе по версии </span><a href="http://www.officenext.ru/orientir/article_41034_best-office-awards-2019-itogi/" target="_blank" style="background-color: rgb(255, 255, 255); color: rgb(153, 34, 152);">Best Office Awards 2019</a><span style="background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);">. Победители получат Job Offer от Lamoda в тот же день. </span></p><p><br></p><h3>Как это будет?</h3><p><br></p><ul><li>13:00 – 13:30 Регистрация игроков и жеребьевка</li><li>13:30 – 14:30 Приветственное слово (Павел Савельев, Head of Business process automation; Александр Афенов, Team Lead; Алексей Фельде, Tech Lead)</li><li>14:30 – 16:30 РНР-поединок</li><li>16:30 – 17:30 Ланч героев</li><li>17:30 – 18:30 Сергей Заика, тимлид команды сall-center расскажет, как сложился опыт работы Lamoda c kafka и вручит приз за самый каверзный вопрос</li><li>18:30 – 19:00 Награждение и вручение Jоb Offers</li><li>19:00 – 22:00 Вечеринка</li></ul><p><br></p><p><span style="background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);">На PHP в Lamoda написаны ключевые внутренние системы автоматизации: служба доставки, фотостудия, управление платежами, системы управления заказами, а также B2B-направление. Наш </span><a href="https://radar.thoughtworks.com/?sheetId=https%3A%2F%2Fdocs.google.com%2Fspreadsheets%2Fd%2F1-wAPAa51iDNmz-UkY7GoKpOhbDjNtOogWqvIzJqWHQI%2Fedit%23gid%3D0" target="_blank" style="background-color: rgb(255, 255, 255); color: rgb(153, 34, 152);">стек технологий</a><span style="background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);"> — это PHP (пишем на последних версиях), Docker, Symfony 3.4 / 4 в связке с Doctrine 2, PostgreSQL, Kubernetes. Уровень разработки можно оценить по нашему </span><a href="https://github.com/lamoda" target="_blank" style="background-color: rgb(255, 255, 255); color: rgb(153, 34, 152);">github.com/lamoda</a><span style="background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);"> и множеству выступлений на конференциях и митапах. Подробнее о выступлениях и технологиях — на </span><a href="https://tech.lamoda.ru/" target="_blank" style="background-color: rgb(255, 255, 255); color: rgb(153, 34, 152);">tech.lamoda.ru</a><span style="background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);">. </span></p><p><br></p><p><span style="background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);">По любым вопросам пишите мне на quest@lamoda.ru. </span></p><p><span style="background-color: rgb(255, 255, 255); color: rgb(34, 34, 34);">It’s time to play the game.</span>	</p>', 2, 0, 4, '2019-07-16 14:14:09', '2019-07-25 21:03:09'),
	(2, 'test', '<p><span style="color: rgb(161, 0, 0);">test</span></p>', 2, 0, 0, '2019-07-25 20:45:13', '2019-07-25 21:03:10'),
	(3, 'asd', '<p><br></p>', 2, 0, 8, '2019-07-25 21:07:21', '2019-07-26 00:02:54');
/*!40000 ALTER TABLE `posts` ENABLE KEYS */;

-- Дамп структуры для таблица devhub.posts_views
CREATE TABLE IF NOT EXISTS `posts_views` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `posts_id` int(11) DEFAULT NULL,
  `user_id` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- Дамп данных таблицы devhub.posts_views: ~0 rows (приблизительно)
/*!40000 ALTER TABLE `posts_views` DISABLE KEYS */;
/*!40000 ALTER TABLE `posts_views` ENABLE KEYS */;

-- Дамп структуры для таблица devhub.post_hubs
CREATE TABLE IF NOT EXISTS `post_hubs` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `posts_id` int(11) DEFAULT NULL,
  `hub_id` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

-- Дамп данных таблицы devhub.post_hubs: ~5 rows (приблизительно)
/*!40000 ALTER TABLE `post_hubs` DISABLE KEYS */;
INSERT INTO `post_hubs` (`id`, `posts_id`, `hub_id`, `created_at`, `updated_at`) VALUES
	(1, 1, 1, '2019-07-24 00:27:02', '2019-07-24 00:27:02'),
	(2, 1, 12, '2019-07-25 21:03:25', '2019-07-25 21:03:25'),
	(3, 1, 25, '2019-07-25 21:03:29', '2019-07-25 21:03:29'),
	(4, 1, 22, '2019-07-25 21:03:34', '2019-07-25 21:03:34'),
	(5, 1, 45, '2019-07-25 21:03:38', '2019-07-25 21:03:38');
/*!40000 ALTER TABLE `post_hubs` ENABLE KEYS */;

-- Дамп структуры для таблица devhub.post_votes
CREATE TABLE IF NOT EXISTS `post_votes` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `user_id` int(11) DEFAULT NULL,
  `post_id` int(11) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- Дамп данных таблицы devhub.post_votes: ~0 rows (приблизительно)
/*!40000 ALTER TABLE `post_votes` DISABLE KEYS */;
/*!40000 ALTER TABLE `post_votes` ENABLE KEYS */;

-- Дамп структуры для таблица devhub.users
CREATE TABLE IF NOT EXISTS `users` (
  `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,
  `username` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name` varchar(50) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `raiting` int(11) DEFAULT 0,
  `email` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `remember_token` varchar(100) COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`id`),
  UNIQUE KEY `users_email_unique` (`email`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Дамп данных таблицы devhub.users: ~1 rows (приблизительно)
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` (`id`, `username`, `name`, `raiting`, `email`, `email_verified_at`, `password`, `remember_token`, `created_at`, `updated_at`) VALUES
	(2, 'hose1021', 'Микаил', 189000, 'hose1021@gmail.com', NULL, '$2y$10$EQiuMc2cJCELIPps9ASqE.c0w0bmZfNdMrKzmIsDV2RQ0hYBKxjhq', NULL, '2019-07-22 13:36:12', '2019-07-24 12:42:34'),
	(3, 'asd', 'asd', 0, '', NULL, '', NULL, '2019-07-25 23:14:08', '2019-07-25 23:14:08');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;

-- Дамп структуры для таблица devhub.websockets_statistics_entries
CREATE TABLE IF NOT EXISTS `websockets_statistics_entries` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `app_id` varchar(191) COLLATE utf8mb4_unicode_ci NOT NULL,
  `peak_connection_count` int(11) NOT NULL,
  `websocket_message_count` int(11) NOT NULL,
  `api_message_count` int(11) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- Дамп данных таблицы devhub.websockets_statistics_entries: ~0 rows (приблизительно)
/*!40000 ALTER TABLE `websockets_statistics_entries` DISABLE KEYS */;
/*!40000 ALTER TABLE `websockets_statistics_entries` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
